app/views/affiliations/index.html.erb

<% @company.affiliations.each do |affiliation| %>
---
SELECT "affiliations".* FROM "affiliations" WHERE ("affiliations".company_id = 9)