app/views/companies/_form.html.erb

SELECT "service_area_coverages".* FROM "service_area_coverages" WHERE ("service_area_coverages".company_id = 9)
SELECT "service_areas".* FROM "service_areas"
---
				<%
					service_area_coverage = company.service_area_coverages.find_all{|item| item.service_area_id == service_area.id}.first()