app/views/certifications/index.html.erb

SELECT "certifications".* FROM "certifications" WHERE ("certifications".company_id = 9)
---
<% @company.certifications.each do |certification| %>