app/views/associations/index.html.erb

SELECT "associations".* FROM "associations" WHERE ("associations".company_id = 9)
---
<% @company.associations.each do |association| %>