app/views/discounts/index.html.erb

	<tbody>
		<% @company.discounts.each do |discount| %>
---
SELECT "discounts".* FROM "discounts" WHERE ("discounts".company_id = 9)