app/controllers/affiliations_controller.rb

INSERT INTO "affiliations" ("company_id", "start_month", "current_member", "created_at", "name", "description", "end_month", "title", "start_year", "end_year", "uri", "updated_at") VALUES (9, 3, NULL, '2011-08-16 05:07:21.332107', 'saerase', 'aseraer', 5, 'asetase', 1969, 1966, 'http://google.com', '2011-08-16 05:07:21.332107')
---
  def create
    @affiliation = Affiliation.new(params[:affiliation])
    if @affiliation.save

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 9 LIMIT 1
---
  def index
    raise "No company id passed while creating a new certification" if params[:company_id].nil?
    @company = Company.find_by_id params[:company_id]

SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."id" = 25 LIMIT 1
DELETE FROM "affiliations" WHERE "affiliations"."id" = 25
---
  def destroy
    @affiliation = Affiliation.find(params[:id])
    @affiliation.destroy