app/controllers/associations_controller.rb

INSERT INTO "associations" ("end_year", "start_month", "current_member", "name", "description", "title", "updated_at", "uri", "end_month", "company_id", "created_at", "start_year") VALUES (NULL, NULL, 't', 'test', 'test', 'test', '2011-08-16 05:52:26.324516', '', NULL, 9, '2011-08-16 05:52:26.324516', NULL)
---
  def create
    @association = Association.new(params[:association])
    if @association.save

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 9 LIMIT 1
---
  def index
    raise "No company id passed while creating a new certification" if params[:company_id].nil?
    @company = Company.find_by_id params[:company_id]

SELECT "associations".* FROM "associations" WHERE "associations"."id" = 1 LIMIT 1
DELETE FROM "associations" WHERE "associations"."id" = 1
---
  def destroy
    @association = Association.find(params[:id])
    @association.destroy