app/controllers/certifications_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 9 LIMIT 1
INSERT INTO "certifications" ("created_at", "name", "certificate_filename", "title", "updated_at", "company_id", "description") VALUES ('2011-08-16 05:33:08.284525', 'test', '2011-02-01.jpg', 'test 42', '2011-08-16 05:33:08.284525', 9, 'test')
---
  def create
    @certification = Certification.new(params[:certification])
    @company = Company.find_by_id @certification.company_id

    if params[:certificate_file]
      @certification.certificate_filename = params[:certificate_file].original_filename
      path = "assets/data/#{@company.id}/certifications"
      FileUtils.mkdir_p path unless File.exists?(path) && File.directory?(path)
      File.open("#{path}/#{@certification.certificate_filename}", "wb") do |f|
        f.write(params[:certificate_file].read)
      end
    end

    if @certification.save

SELECT "certifications".* FROM "certifications" WHERE "certifications"."id" = 11 LIMIT 1
DELETE FROM "certifications" WHERE "certifications"."id" = 11
---
  def destroy
    @certification = Certification.find(params[:id])
    @certification.destroy

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 9 LIMIT 1
---
  def index
    raise "No company id passed while creating a new certification" if params[:company_id].nil?
    @company = Company.find_by_id params[:company_id]