app/controllers/companies_controller.rb

INSERT INTO "companies" ("web_site", "mobile_phone_number", "name", "general_info", "address_2", "emergency_services", "updated_at", "business_certificate_number", "business_status_type", "personal_license_type", "fax_number", "state", "personal_license_number", "in_business_since", "main_phone_number", "email_address", "description", "discount_title", "is_insurance", "about", "discount_start_date", "discount_end_date", "certificate_of_insurance_filename", "filing_number", "created_at", "city", "insurance_expiration_year", "discount_description", "company_category_id", "is_active", "business_certificate_type", "discount_type", "insurance_expiration_month", "twenty_four_hour_service", "address_1", "zip_code") VALUES ('http://google.com', '', 'Secondary Test Business', NULL, '', NULL, '2011-09-02 04:26:15.680450', NULL, NULL, NULL, '', 'MN', NULL, '2011-08-31', '320-761-3394', 'jordan.t.cox@gmail.com', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2011-09-02 04:26:15.680450', 'Saint Cloud', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '1234 Main STreet', '56301')
---
    def create
        @company = Company.new params[:company]
        if @company.save

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1
---
    def show
        @company = Company.find_by_id params[:id]

SELECT "company_categories".* FROM "company_categories"
SELECT "company_subcategories".* FROM "company_subcategories"
SELECT "service_areas".* FROM "service_areas"
SELECT "service_area_coverages".* FROM "service_area_coverages" WHERE ("service_area_coverages".company_id = 9)
INSERT INTO "service_area_coverages" ("updated_at", "coverage_type", "company_id", "created_at", "service_area_id") VALUES ('2011-08-14 04:30:11.001692', 0, 9, '2011-08-14 04:30:11.001692', NULL)
UPDATE "service_areas" SET "updated_at" = '2011-08-14 04:29:20.841806' WHERE "service_areas"."id" = 1
---
    def edit
        @company_categories = CompanyCategory.all
        @company_subcategories = CompanySubcategory.all
        @service_areas = ServiceArea.all

        @company.business_certificate = BusinessCertificate.new if @company.business_certificate.nil?
        @company.personal_certificate = PersonalCertificate.new if @company.personal_certificate.nil?

        @service_areas.each do |service_area|
            coverage = @company.service_area_coverages.find_all{|item| item.service_area_id == service_area.id}.first()
            needs_saving = false
            if coverage.nil?
                coverage = ServiceAreaCoverage.new()
                coverage.company_id = @company.id
                coverage.service_area_id = service_area.id
                coverage.coverage_type = 0
                @company.service_area_coverages << coverage
                needs_saving = true
            end
            @company.save if needs_saving

SELECT "companies".* FROM "companies" WHERE (name like 'test%')
---
    def search_json
        begin
            raise "No search term provided" unless params[:company_name]
            escaped_name =  params[:company_name].gsub ('%', '\%').gsub ('_', '\_')
            @companies = Company.find (:all, :conditions=> ["name like ?", escaped_name + "%"])

SELECT "service_area_coverages".* FROM "service_area_coverages" WHERE ("service_area_coverages".company_id = 9)
INSERT INTO "service_area_coverages" ("updated_at", "service_area_id", "company_id", "coverage_type", "created_at") VALUES ('2011-08-14 05:54:42.721814', 1, 9, 1, '2011-08-14 05:54:42.721814')
---
    def update
        @company.business_certificate = BusinessCertificate.new params[:business_certificate]
        @company.business_certificate.company_id = @company.id

        @company.personal_certificate = PersonalCertificate.new params[:personal_certificate]
        @company.personal_certificate.company_id = @company.id

        if !params[:service_area_coverages].nil? and params[:service_area_coverages].count > 0
            @company.service_area_coverages.delete_all
            params[:service_area_coverages].each do |entry|
                service_area_coverage = ServiceAreaCoverage.new(entry)
                @company.service_area_coverages << service_area_coverage

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 9 LIMIT 1
---
    def find_company
      @company = Company.find(params[:id])