app/controllers/company_categories_controller.rb

INSERT INTO "companies" ("twenty_four_hour_service", "filing_number", "in_business_since", "is_insurance", "state", "email_address", "description", "web_site", "emergency_services", "business_status_type", "insurance_expiration_year", "personal_license_number", "business_certificate_type", "name", "discount_start_date", "personal_license_type", "discount_description", "address_2", "discount_type", "updated_at", "zip_code", "created_at", "main_phone_number", "general_info", "company_category_id", "insurance_expiration_month", "fax_number", "discount_end_date", "address_1", "about", "discount_title", "city", "business_certificate_number", "is_active", "mobile_phone_number") VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2011-08-12 00:59:14.737326', NULL, '2011-08-12 00:59:14.737326', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
INSERT INTO "company_categories" ("created_at", "name", "updated_at") VALUES ('2011-08-14 02:41:55.455483', 'HVAC', '2011-08-14 02:41:55.455483')
---
  def create
    @company_category = CompanyCategory.new(params[:company_category])
    if @company_category.save