app/controllers/companies_controller.rb

  def edit
    @company.build_personal_license if @company.personal_license.nil?
    @company.build_business_license if @company.business_license.nil?
    @company.build_business_filing if @company.business_filing.nil?
    @company.affiliations.build if @company.affiliations.empty?
---
SELECT "affiliations".* FROM "affiliations" WHERE ("affiliations".company_id = 9)

  def update

    respond_to do |wants|
      if @company.update_attributes(params[:company])
---
UPDATE "companies" SET "updated_at" = '2011-08-14 06:12:39.864580', "business_certificate_number" = 'BUS001', "personal_license_number" = 'PERS001', "business_certificate_type" = '1', "personal_license_type" = '1' WHERE "companies"."id" = 9