app/controllers/discounts_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" IS NULL LIMIT 1
INSERT INTO "discounts" ("end_date", "market_id", "updated_at", "company_id", "created_at", "start_date", "title", "image_filename", "description", "type") VALUES ('2011-08-25', 1, '2011-08-19 13:09:46.134935', 9, '2011-08-19 13:09:46.134935', '2011-08-03', 'This is a test title', 'TM_Provider_profile_v2.5.pdf', 'This is a test description', NULL)
---
    def create
         @discount = Discount.new(params[:discount])
         @company = Company.find_by_id @discount.company_id

         if params[:image_file]
             @discount.image_filename = params[:image_file].original_filename
             path = "assets/data/#{@company.id}/discounts"
             FileUtils.mkdir_p path unless File.exists?(path) && File.directory?(path)
             File.open("#{path}/#{@discount.image_filename}", "wb"){|f| f.write(params[:image_file].read) }
         end

         if @discount.save

SELECT "discounts".* FROM "discounts" WHERE "discounts"."id" = 5 LIMIT 1
UPDATE "discounts" SET "updated_at" = '2011-08-25 01:09:55.805347', "image_filename" = NULL WHERE "discounts"."id" = 5
---
    def destroy_image
        begin
            @discount = Discount.find params[:id]
            raise "Could not locate discount with id of #{params[:id]}" if @discount.nil?
            path = "assets/data/#{@discount.company_id}/discounts/#{@discount.image_filename}"
            image_does_not_exist = @discount.image_filename.nil? or !File.exists? path

            @discount.image_filename = nil
            @discount.save

SELECT "discounts".* FROM "discounts" WHERE "discounts"."id" = 5 LIMIT 1
---
     def edit
         raise "No discount id passed while editing a discount" if params[:id].nil?
         @discount = Discount.find params[:id]

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 9 LIMIT 1
---
     def index
         raise "No company id passed while creating a new certification" if params[:company_id].nil?
         @company = Company.find_by_id params[:company_id]

SELECT "discounts".* FROM "discounts" WHERE "discounts"."id" = 5 LIMIT 1
---
    def show_image
        @discount = Discount.find params[:id]

SELECT "discounts".* FROM "discounts" WHERE "discounts"."id" = 5 LIMIT 1
UPDATE "discounts" SET "type_id" = 1, "updated_at" = '2011-08-25 00:21:05.183833', "image_filename" = 'photo-2.jpg' WHERE "discounts"."id" = 5
---
     def update
         @discount = Discount.find(params[:id])
         if params[:image_file]
              @discount.image_filename = params[:image_file].original_filename
              path = "assets/data/#{@discount.company_id}/discounts"
              FileUtils.mkdir_p path unless File.exists?(path) && File.directory?(path)
              File.open("#{path}/#{@discount.image_filename}", "wb"){|f| f.write(params[:image_file].read) }
          end

         if @discount.update_attributes(params[:discount])

SELECT "discounts".* FROM "discounts" WHERE "discounts"."id" = 1 LIMIT 1
DELETE FROM "discounts" WHERE "discounts"."id" = 1
---
     def destroy
         @discount = Discount.find(params[:id])
         @discount.destroy