app/controllers/users_controller.rb

    def create
        @user = User.new(params[:user])

        respond_to do |wants|
            if @user.save
---
INSERT INTO "users" ("last_name", "email_address", "password_hash", "created_at", "updated_by", "is_admin", "first_name", "password_salt", "created_by", "updated_at") VALUES ('Administrator', 'testing.administrator@test.com', NULL, '2011-08-09 06:34:05.851172', NULL, 't', 'Testing', NULL, NULL, '2011-08-09 06:34:05.851172')

    def destroy
        begin
            raise "Could not locate the specified user" if @user.nil?
            raise "You cannot delete your own user" if @user.id == @logged_in_user.id
            @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = 2

    def update
        respond_to do |wants|
            @user.updated_by = request.remote_addr
---
UPDATE "users" SET "updated_by" = '127.0.0.1', "password_hash" = '32f8a2041c1444a6f80eca82fde7c945b8ae45d9', "updated_at" = '2011-08-09 07:33:30.569596', "password_salt" = 'K7PQqAJ8Xr' WHERE "users"."id" = 8

    def validate_email_is_unique
        @user = User.find_by_email_address params[:user][:email_address]
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = 'test@test.c' LIMIT 1

    def find_user
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE (email_address = 'testing.administrator@test.com') LIMIT 1